## Cenário II

##### Lendo o Arquivo

In [1]:
import pandas as pd
arquivo = '/content/drive/MyDrive/Colab Notebooks/Lambda3/Teste 2/data.json'
df = pd.read_json(arquivo)

### Trabalhando os Dados

Foi retirada a coluna 'ItemList' para pode trabalhar primeiro com as linhas que restaram.

In [2]:
df1 = df.drop('ItemList',1)

Foram separadas as linhas do dataframe.

In [3]:
zero_linha = df1.loc[0:0]
primeira_linha = df1.loc[1:1]
segunda_linha = df1.loc[2:2]

A seguir foram adicionadas a quantidade de linhas relacionas a quantidade de itens na coluna 'ItemList'

In [4]:
df_c = zero_linha.append(zero_linha)
df_c = df_c.append(zero_linha)
df_c = df_c.append(primeira_linha)
df_c = df_c.append(primeira_linha)
df_c = df_c.append(segunda_linha)
df_c = df_c.append(segunda_linha)
df_c = df_c.append(segunda_linha)

#### Análise da Coluna 'ItemList'

In [5]:
linha1 = df['ItemList'][0]
linha2 = df['ItemList'][1]
linha3 = df['ItemList'][2]

In [6]:
linha0 = pd.DataFrame(df['ItemList'][0], index=['0', '1', '2'])
linha1 = pd.DataFrame(df['ItemList'][1], index=['0', '1'])
linha2 = pd.DataFrame(df['ItemList'][2], index=['0', '1', '2'])

Foram separados em 3 listas: ProductName (contém o nome dos produtos), value e quantity.

In [7]:
ProductName0 = linha0['ProductName'].to_list()
ProductName1 = linha1['ProductName'].to_list()
ProductName2 = linha2['ProductName'].to_list()
ProductName = ProductName0 + ProductName1 + ProductName2
ProductName

['Rice',
 'Flour',
 'Bean',
 'Tomate',
 'Pasta',
 'Beer',
 'French fries',
 'Ice cream']

In [8]:
value0 = linha0['Value'].to_list()
value1 = linha1['Value'].to_list()
value2 = linha2['Value'].to_list()
value = value0 + value1 + value2
value

[35.55, 11.55, 27.15, 12.25, 7.55, 9.0, 10.99, 27.15]

In [9]:
quantity0 = linha0['Quantity'].to_list()
quantity1 = linha1['Quantity'].to_list()
quantity2 = linha2['Quantity'].to_list()
quantity = quantity0 + quantity1 + quantity2
quantity

[2, 5, 7, 10, 5, 6, 2, 1]

Foram acrescidos ao df_c cada uma das listas em forma de coluna formando então o df_completo. Esta variável está em formato dataframe e contém todas as informações disponíveis no arquivo.

In [10]:
df_c['ProductName'] = ProductName
df_c['Value'] = value
df_c['Quantity'] = quantity

In [11]:
df_completo = df_c

In [12]:
df_completo.reset_index(inplace=True, drop=True)
df_completo

               CreateDate         EmissionDate  ...  Value  Quantity
0  2021-05-24T20:21:34.79  2021-05-24T00:00:00  ...  35.55         2
1  2021-05-24T20:21:34.79  2021-05-24T00:00:00  ...  11.55         5
2  2021-05-24T20:21:34.79  2021-05-24T00:00:00  ...  27.15         7
3  2021-05-24T20:21:34.79  2021-05-24T00:00:00  ...  12.25        10
4  2021-05-24T20:21:34.79  2021-05-24T00:00:00  ...   7.55         5
5  2021-05-24T20:21:34.79  2021-05-24T00:00:00  ...   9.00         6
6  2021-05-24T20:21:34.79  2021-05-24T00:00:00  ...  10.99         2
7  2021-05-24T20:21:34.79  2021-05-24T00:00:00  ...  27.15         1

[8 rows x 8 columns]

A partir disso foi criado uma novo DataFrame com as informações apenas do 'ItemList'

In [13]:
df_separado = df_completo.iloc[:,5:]
df_separado

    ProductName  Value  Quantity
0          Rice  35.55         2
1         Flour  11.55         5
2          Bean  27.15         7
3        Tomate  12.25        10
4         Pasta   7.55         5
5          Beer   9.00         6
6  French fries  10.99         2
7     Ice cream  27.15         1

Os df_completo e df_separado podem ser correlacionados com seus indices de linhas e sua colunas.